JKN0/RocManV2/Software/STC8A8.h
/*-------------------------------------------------------------------------
 STC8A8.h
 
 H-file for STC8A8K64D4 etc.
-------------------------------------------------------------------------*/

#ifndef _STC8A8_H
#define _STC8A8_H

#include <8051.h>
#include <compiler.h>

#ifdef REG8051_H
#undef REG8051_H
#endif

// --- AUXR -------------------------------------------------------------------------------------

SFR(AUXR,0x8E);
#define T0x12     0x80    // AUXR.7
#define T1x12     0x40    // AUXR.6
#define UART_M0x6 0x20    // AUXR.5
#define T2R       0x10    // AUXR.4
#define T2_CT     0x08    // AUXR.3
#define T2x12     0x04    // AUXR.2
#define EXTRAM    0x02    // AUXR.1
#define S1ST2     0x01    // AUXR.0

// --- Pin switch -------------------------------------------------------------------------------------

SFR(P_SW1,0xA2);
#define S1_S1     0x80    // P_SW1.7
#define S1_S0     0x40    // P_SW1.6
#define CCP_S1    0x20    // P_SW1.5
#define CCP_S0    0x10    // P_SW1.4
#define SPI_S1    0x08    // P_SW1.3
#define SPI_S0    0x04    // P_SW1.2

SFR(P_SW2,0xBA);
#define EAXFR     0x80    // P_SW2.7
#define I2C_S1    0x20    // P_SW2.5
#define I2C_S0    0x10    // P_SW2.4
#define CMPO_S    0x08    // P_SW2.3
#define S4_S      0x04    // P_SW2.2
#define S3_S      0x02    // P_SW2.1
#define S2_S      0x01    // P_SW2.0

// --- Interrupts -------------------------------------------------------------------------------------

// IE deviations
SBIT(EADC, 0xA8, 5);    // normally ET2
SBIT(ELVD, 0xA8, 6);    // normally EC

// IE2
SFR(IE2,0xAF);
#define ET4     0x40    // IE2.6
#define ET3     0x20    // IE2.5
#define ES4     0x10    // IE2.4
#define ES3     0x08    // IE2.3
#define ET2     0x04    // IE2.2
#define ESPI    0x02    // IE2.1
#define ES2     0x01    // IE2.0

// INTCLKO
SFR(INTCLKO,0x8F);
#define EX4     0x40    // INTCLKO.6
#define EX3     0x20    // INTCLKO.5
#define EX2     0x10    // INTCLKO.4
#define T2CLKO  0x04    // INTCLKO.2
#define T1CLKO  0x02    // INTCLKO.1
#define T0CLKO  0x01    // INTCLKO.0

// IP deviations
SBIT(PADC, 0xB8, 5);    // normally PT2
SBIT(PLVD, 0xB8, 6);    // normally PPC
SBIT(PPCA, 0xB8, 7);

SFR(AUXINTIF,0xEF); 
#define INT4IF  0x40    // AUXINTIF.6
#define INT3IF  0x20    // AUXINTIF.5
#define INT2IF  0x10    // AUXINTIF.4
#define T4IF    0x04    // AUXINTIF.2
#define T3IF    0x02    // AUXINTIF.1
#define T2IF    0x01    // AUXINTIF.0


// IPH
SFR(IPH,0xB7);
#define PPCAH   0x80    // IPH.7
#define PLVDH   0x40    // IPH.6
#define PADCH   0x20    // IPH.5
#define PSH     0x10    // IPH.4
#define PT1H    0x08    // IPH.3
#define PX1H    0x04    // IPH.2
#define PT0H    0x02    // IPH.1
#define PX0H    0x01    // IPH.0

// IP2
SFR(IP2,0xB5);
#define PI2C    0x40    // IP2.6
#define PCMP    0x20    // IP2.5
#define PX4     0x10    // IP2.4
#define PPWMFD  0x08    // IP2.3
#define PPWM    0x04    // IP2.2
#define PSPI    0x02    // IP2.1
#define PS2     0x01    // IP2.0

// IP2H
SFR(IP2H ,0xB6);
#define PI2CH   0x40    // IP2H.6
#define PCMPH   0x20    // IP2H.5
#define PX4H    0x10    // IP2H.4
#define PPWMFDH 0x08    // IP2H.3
#define PPWMH   0x04    // IP2H.2
#define PSPIH   0x02    // IP2H.1
#define PS2H    0x01    // IP2H.0

// IP3
SFR(IP3,0xDF); 
#define PS4     0x02    // IP3.1
#define PS3     0x01    // IP3.0

// IP3H
SFR(IP3H,0xEE);
#define PS4H    0x02    // IP3H.1
#define PS3H    0x01    // IP3H.0

#define P0INTE         (*(unsigned char volatile __xdata *)0xFD00)
#define P1INTE         (*(unsigned char volatile __xdata *)0xFD01)
#define P2INTE         (*(unsigned char volatile __xdata *)0xFD02)
#define P3INTE         (*(unsigned char volatile __xdata *)0xFD03)
#define P4INTE         (*(unsigned char volatile __xdata *)0xFD04)
#define P5INTE         (*(unsigned char volatile __xdata *)0xFD05)
#define P6INTE         (*(unsigned char volatile __xdata *)0xFD06)
#define P7INTE         (*(unsigned char volatile __xdata *)0xFD07)

#define P0INTF         (*(unsigned char volatile __xdata *)0xFD10)
#define P1INTF         (*(unsigned char volatile __xdata *)0xFD11)
#define P2INTF         (*(unsigned char volatile __xdata *)0xFD12)
#define P3INTF         (*(unsigned char volatile __xdata *)0xFD13)
#define P4INTF         (*(unsigned char volatile __xdata *)0xFD14)
#define P5INTF         (*(unsigned char volatile __xdata *)0xFD15)
#define P6INTF         (*(unsigned char volatile __xdata *)0xFD16)
#define P7INTF         (*(unsigned char volatile __xdata *)0xFD17)

// TODO: similar macros than for I/O modes
// IM1,IM0:
//   0,0 = falling edge
//   0,1 = rising edge
//   1,0 = low level
//   1,1 = high level

#define P0IM0          (*(unsigned char volatile __xdata *)0xFD20)
#define P1IM0          (*(unsigned char volatile __xdata *)0xFD21)
#define P2IM0          (*(unsigned char volatile __xdata *)0xFD22)
#define P3IM0          (*(unsigned char volatile __xdata *)0xFD23)
#define P4IM0          (*(unsigned char volatile __xdata *)0xFD24)
#define P5IM0          (*(unsigned char volatile __xdata *)0xFD25)
#define P6IM0          (*(unsigned char volatile __xdata *)0xFD26)
#define P7IM0          (*(unsigned char volatile __xdata *)0xFD27)

#define P0IM1          (*(unsigned char volatile __xdata *)0xFD30)
#define P1IM1          (*(unsigned char volatile __xdata *)0xFD31)
#define P2IM1          (*(unsigned char volatile __xdata *)0xFD32)
#define P3IM1          (*(unsigned char volatile __xdata *)0xFD33)
#define P4IM1          (*(unsigned char volatile __xdata *)0xFD34)
#define P5IM1          (*(unsigned char volatile __xdata *)0xFD35)
#define P6IM1          (*(unsigned char volatile __xdata *)0xFD36)
#define P7IM1          (*(unsigned char volatile __xdata *)0xFD37)

#define PINIPL         (*(unsigned char volatile __xdata *)0xFD60)
#define PINIPH         (*(unsigned char volatile __xdata *)0xFD61)

#define P0WKUE         (*(unsigned char volatile __xdata *)0xFD40)
#define P1WKUE         (*(unsigned char volatile __xdata *)0xFD41)
#define P2WKUE         (*(unsigned char volatile __xdata *)0xFD42)
#define P3WKUE         (*(unsigned char volatile __xdata *)0xFD43)
#define P4WKUE         (*(unsigned char volatile __xdata *)0xFD44)
#define P5WKUE         (*(unsigned char volatile __xdata *)0xFD45)
#define P6WKUE         (*(unsigned char volatile __xdata *)0xFD46)
#define P7WKUE         (*(unsigned char volatile __xdata *)0xFD47)

// --- I/O ports --------------------------------------------------------------------------------------

