JKN0/RocManV2/Software/STC8A8.h
// Macros for port I/O modes

// PxM1,PxM0: 
//   0,0 -> quasi bd
//   0,1 -> push-pull
//   1,0 -> input (default)
//   1,1 -> open drain

#define B0   0x01
#define B1   0x02
#define B2   0x04
#define B3   0x08
#define B4   0x10
#define B5   0x20
#define B6   0x40
#define B7   0x80
#define ALL  0xFF

#define QUASIBD   0
#define PUSHPULL  1
#define INPUT     2
#define OPENDRAIN 3

#define P0_pinmode(mode,pins)  { if (mode==QUASIBD || mode==PUSHPULL) P0M1 &= ~(pins); else P0M1 |= (pins);\
                                 if (mode==QUASIBD || mode==INPUT)    P0M0 &= ~(pins); else P0M0 |= (pins); }
#define P1_pinmode(mode,pins)  { if (mode==QUASIBD || mode==PUSHPULL) P1M1 &= ~(pins); else P1M1 |= (pins);\
                                 if (mode==QUASIBD || mode==INPUT)    P1M0 &= ~(pins); else P1M0 |= (pins); }
#define P2_pinmode(mode,pins)  { if (mode==QUASIBD || mode==PUSHPULL) P2M1 &= ~(pins); else P2M1 |= (pins);\
                                 if (mode==QUASIBD || mode==INPUT)    P2M0 &= ~(pins); else P2M0 |= (pins); }
#define P3_pinmode(mode,pins)  { if (mode==QUASIBD || mode==PUSHPULL) P3M1 &= ~(pins); else P3M1 |= (pins);\
                                 if (mode==QUASIBD || mode==INPUT)    P3M0 &= ~(pins); else P3M0 |= (pins); }
#define P4_pinmode(mode,pins)  { if (mode==QUASIBD || mode==PUSHPULL) P4M1 &= ~(pins); else P4M1 |= (pins);\
                                 if (mode==QUASIBD || mode==INPUT)    P4M0 &= ~(pins); else P4M0 |= (pins); }
#define P5_pinmode(mode,pins)  { if (mode==QUASIBD || mode==PUSHPULL) P5M1 &= ~(pins); else P5M1 |= (pins);\
                                 if (mode==QUASIBD || mode==INPUT)    P5M0 &= ~(pins); else P5M0 |= (pins); }
#define P6_pinmode(mode,pins)  { if (mode==QUASIBD || mode==PUSHPULL) P6M1 &= ~(pins); else P6M1 |= (pins);\
                                 if (mode==QUASIBD || mode==INPUT)    P6M0 &= ~(pins); else P6M0 |= (pins); }
#define P7_pinmode(mode,pins)  { if (mode==QUASIBD || mode==PUSHPULL) P7M1 &= ~(pins); else P7M1 |= (pins);\
                                 if (mode==QUASIBD || mode==INPUT)    P7M0 &= ~(pins); else P7M0 |= (pins); }

SFR(P4,0xC0);
SFR(P5,0xC8);
SFR(P6,0xE8);
SFR(P7,0xF8);

SFR(P0M1,0x93);
SFR(P0M0,0x94);
SFR(P1M1,0x91);
SFR(P1M0,0x92);
SFR(P2M1,0x95);
SFR(P2M0,0x96);
SFR(P3M1,0xB1);
SFR(P3M0,0xB2);
SFR(P4M1,0xB3);
SFR(P4M0,0xB4);
SFR(P5M1,0xC9);
SFR(P5M0,0xCA);
SFR(P6M1,0xCB);
SFR(P6M0,0xCC);
SFR(P7M1,0xE1);
SFR(P7M0,0xE2);

SBIT(P4_0,0xC0,0);
SBIT(P4_1,0xC0,1);
SBIT(P4_2,0xC0,2);
SBIT(P4_3,0xC0,3);
SBIT(P4_4,0xC0,4);
SBIT(P4_5,0xC0,5);
SBIT(P4_6,0xC0,6);
SBIT(P4_7,0xC0,7);

SBIT(P5_0,0xC8,0);
SBIT(P5_1,0xC8,1);
SBIT(P5_2,0xC8,2);
SBIT(P5_3,0xC8,3);
SBIT(P5_4,0xC8,4);
SBIT(P5_5,0xC8,5);
SBIT(P5_6,0xC8,6);
SBIT(P5_7,0xC8,7);

SBIT(P6_0,0xE8,0);
SBIT(P6_1,0xE8,1);
SBIT(P6_2,0xE8,2);
SBIT(P6_3,0xE8,3);
SBIT(P6_4,0xE8,4);
SBIT(P6_5,0xE8,5);
SBIT(P6_6,0xE8,6);
SBIT(P6_7,0xE8,7);

SBIT(P7_0,0xF8,0);
SBIT(P7_1,0xF8,1);
SBIT(P7_2,0xF8,2);
SBIT(P7_3,0xF8,3);
SBIT(P7_4,0xF8,4);
SBIT(P7_5,0xF8,5);
SBIT(P7_6,0xF8,6);
SBIT(P7_7,0xF8,7);

#define P0PU           (*(unsigned char volatile __xdata *)0xFE10)
#define P1PU           (*(unsigned char volatile __xdata *)0xFE11)
#define P2PU           (*(unsigned char volatile __xdata *)0xFE12)
#define P3PU           (*(unsigned char volatile __xdata *)0xFE13)
#define P4PU           (*(unsigned char volatile __xdata *)0xFE14)
#define P5PU           (*(unsigned char volatile __xdata *)0xFE15)
#define P6PU           (*(unsigned char volatile __xdata *)0xFE16)
#define P7PU           (*(unsigned char volatile __xdata *)0xFE17)
                   
#define P0NCS          (*(unsigned char volatile __xdata *)0xFE18)
#define P1NCS          (*(unsigned char volatile __xdata *)0xFE19)
#define P2NCS          (*(unsigned char volatile __xdata *)0xFE1A)
#define P3NCS          (*(unsigned char volatile __xdata *)0xFE1B)
#define P4NCS          (*(unsigned char volatile __xdata *)0xFE1C)
#define P5NCS          (*(unsigned char volatile __xdata *)0xFE1D)
#define P6NCS          (*(unsigned char volatile __xdata *)0xFE1E)
#define P7NCS          (*(unsigned char volatile __xdata *)0xFE1F)
                   
#define P0SR           (*(unsigned char volatile __xdata *)0xFE20)
#define P1SR           (*(unsigned char volatile __xdata *)0xFE21)
#define P2SR           (*(unsigned char volatile __xdata *)0xFE22)
#define P3SR           (*(unsigned char volatile __xdata *)0xFE23)
#define P4SR           (*(unsigned char volatile __xdata *)0xFE24)
#define P5SR           (*(unsigned char volatile __xdata *)0xFE25)
#define P6SR           (*(unsigned char volatile __xdata *)0xFE26)
#define P7SR           (*(unsigned char volatile __xdata *)0xFE27)
                     
#define P0DR           (*(unsigned char volatile __xdata *)0xFE28)
#define P1DR           (*(unsigned char volatile __xdata *)0xFE29)
#define P2DR           (*(unsigned char volatile __xdata *)0xFE2A)
#define P3DR           (*(unsigned char volatile __xdata *)0xFE2B)
#define P4DR           (*(unsigned char volatile __xdata *)0xFE2C)
#define P5DR           (*(unsigned char volatile __xdata *)0xFE2D)
#define P6DR           (*(unsigned char volatile __xdata *)0xFE2E)
#define P7DR           (*(unsigned char volatile __xdata *)0xFE2F)

// Set to 0, when used as analog input (default = 1)
#define P0IE           (*(unsigned char volatile __xdata *)0xFE30)
#define P1IE           (*(unsigned char volatile __xdata *)0xFE31)
#define P2IE           (*(unsigned char volatile __xdata *)0xFE32)
#define P3IE           (*(unsigned char volatile __xdata *)0xFE33)
#define P4IE           (*(unsigned char volatile __xdata *)0xFE34)
#define P5IE           (*(unsigned char volatile __xdata *)0xFE35)
#define P6IE           (*(unsigned char volatile __xdata *)0xFE36)
#define P7IE           (*(unsigned char volatile __xdata *)0xFE37)

// --- Timers ------------------------------------------------------------------------------------

SFR(T4T3M,0xD1);
#define T4R     0x80    // T4T3M.7
#define T4_CT   0x40    // T4T3M.6
#define T4x12   0x20    // T4T3M.5
#define T4CLKO  0x10    // T4T3M.4
#define T3R     0x08    // T4T3M.3
#define T3_CT   0x04    // T4T3M.2
#define T3x12   0x02    // T4T3M.1
#define T3CLKO  0x01    // T4T3M.0

SFR(T4H,0xD2);
SFR(T4L,0xD3);
SFR(T3H,0xD4);
SFR(T3L,0xD5);
SFR(T2H,0xD6);
SFR(T2L,0xD7);

