JKN0/RocManV2/Software/STC8A8.h
SFR16E(TMR2,0xD6D7);
SFR16E(TMR3,0xD4D5);
SFR16E(TMR4,0xD2D3);

SFR(WKTCL,0xAA);
SFR(WKTCH,0xAB);
#define WKTEN   0x80    // WKTCH.7

#define TM2PS          (*(unsigned char volatile __xdata *)0xFEA2)
#define TM3PS          (*(unsigned char volatile __xdata *)0xFEA3)
#define TM4PS          (*(unsigned char volatile __xdata *)0xFEA4)
#define ADCTIM         (*(unsigned char volatile __xdata *)0xFEA8)


// --- UARTS ---------------------------------------------------------------------------------------

SFR(S2BUF,0x9B);
SFR(S2CON,0x9A);
#define S2SM0   0x80    // S2CON.7
#define S2SM2   0x20    // S2CON.5
#define S2REN   0x10    // S2CON.4
#define S2TB8   0x08    // S2CON.3
#define S2RB8   0x04    // S2CON.2
#define S2TI    0x02    // S2CON.1
#define S2RI    0x01    // S2CON.0

SFR(S3BUF,0xAD);
SFR(S3CON,0xAC);
#define S3SM0   0x80    // S3CON.7
#define S3ST3   0x40    // S3CON.6
#define S3SM2   0x20    // S3CON.5
#define S3REN   0x10    // S3CON.4
#define S3TB8   0x08    // S3CON.3
#define S3RB8   0x04    // S3CON.2
#define S3TI    0x02    // S3CON.1
#define S3RI    0x01    // S3CON.0

SFR(S4BUF,0x85);
SFR(S4CON,0x84);
#define S4SM0   0x80    // S4CON.7
#define S4ST3   0x40    // S4CON.6
#define S4SM2   0x20    // S4CON.5
#define S4REN   0x10    // S4CON.4
#define S4TB8   0x08    // S4CON.3
#define S4RB8   0x04    // S4CON.2
#define S4TI    0x02    // S4CON.1
#define S4RI    0x01    // S4CON.0

SFR(SADDR,0xA9);
SFR(SADEN,0xB9);

// --- SPI ---------------------------------------------------------------------------------------

SFR(SPSTAT,0xCD);

#define SPIF    0x80    // SPSTAT.7
#define WCOL    0x40    // SPSTAT.6

SFR(SPCTL,0xCE);

#define SSIG    0x80    // SPCTL.7
#define SPEN    0x40    // SPCTL.6
#define DORD    0x20    // SPCTL.5
#define MSTR    0x10    // SPCTL.4
#define CPOL    0x08    // SPCTL.3
#define CPHA    0x04    // SPCTL.2
#define SPR1    0x02    // SPCTL.1
#define SPR0    0x01    // SPCTL.0

SFR(SPDAT,0xCF);

// --- PCA ---------------------------------------------------------------------------------------

SFR(CCON,0xD8);
SBIT(CF,0xD8,7);
SBIT(CR,0xD8,6);
SBIT(CCF3,0xD8,3);
SBIT(CCF2,0xD8,2);
SBIT(CCF1,0xD8,1);
SBIT(CCF0,0xD8,0);

SFR(CMOD,0xD9);
#define CIDL    0x80    // CMOD.7
#define CPS2    0x08    // CMOD.3
#define CPS1    0x04    // CMOD.2
#define CPS0    0x02    // CMOD.1
#define EXF     0x01    // CMOD.0

SFR(CCAPM0,0xDA);
SFR(CCAPM1,0xDB);
SFR(CCAPM2,0xDC);
SFR(CL    ,0xE9);  
SFR(CH    ,0xF9);

SFR(CCAP0L,0xEA);  
SFR(CCAP1L,0xEB);  
SFR(CCAP2L,0xEC);  
SFR(CCAP0H,0xFA);
SFR(CCAP1H,0xFB);
SFR(CCAP2H,0xFC);

SFR(PCA_PWM0,0xF2); 
SFR(PCA_PWM1,0xF3);
SFR(PCA_PWM2,0xF4);

#define CCAPM3   (*(unsigned char volatile __xdata *)0xFD54)
#define CCAP3L   (*(unsigned char volatile __xdata *)0xFD55)
#define CCAP3H   (*(unsigned char volatile __xdata *)0xFD56)

SFR16E(CCAP0,0xFAEA);
SFR16E(CCAP1,0xFBEB);
SFR16E(CCAP2,0xFCEC);


// --- IAP/EEPROM ---------------------------------------------------------------------------------

SFR(IAP_DATA ,0xC2);
SFR(IAP_ADDRH,0xC3);
SFR(IAP_ADDRL,0xC4);
SFR(IAP_CMD  ,0xC5);
#define CMD_NONE    0x00    // IAP_CMD[1:0]
#define CMD_READ    0x01    // IAP_CMD[1:0]
#define CMD_WRITE   0x02    // IAP_CMD[1:0]
#define CMD_ERASE   0x03    // IAP_CMD[1:0]

SFR(IAP_TRIG ,0xC6);
SFR(IAP_CONTR,0xC7);
#define IAPEN       0x80    // IAP_CONTR.7
#define SWBS        0x40    // IAP_CONTR.6
#define SWRST       0x20    // IAP_CONTR.5
#define CMD_FAIL    0x10    // IAP_CONTR.4

SFR(IAP_TPS,  0xF5);

SFR16E(IAP_ADDR,0xC3C4);

// Same with another names
SFR(ISP_DATA ,0xC2);
SFR(ISP_ADDRH,0xC3);
SFR(ISP_ADDRL,0xC4);
SFR(ISP_CMD  ,0xC5);
SFR(ISP_TRIG ,0xC6);
SFR(ISP_CONTR,0xC7);
SFR(ISP_TPS,  0xF5);
SFR16E(ISP_ADDR,0xC3C4);

// --- TODO ---------------------------------------------------------------------------------------

SFR16E(TMR0,0x8C8A);
__sfr16 __at (0x8D8B) TMR1;
__sfr16 __at (0xD6D7) TMR2;

SFR(WAKE_CLKO,0x8F);
SFR(BUS_SPEED,0xA1);
SFR(TA   ,0xAE);
SFR(VOCTRL   ,0xBB);

SFR(ADC_CONTR,0xBC);
SFR(ADC_RES  ,0xBD);
SFR(ADC_RESL ,0xBE);

SFR(WDT_CONTR,0xC1);

SFR(ADCCFG,0xDE); 

SFR(DPS   ,0xE3);
SFR(DPL1  ,0xE4);
SFR(DPH1  ,0xE5);
SFR(CMPCR1,0xE6);
SFR(CMPCR2,0xE7);

SFR(PWMSET  ,0xF1); 

SFR(PWMCFG01,0xF6);
SFR(PWMCFG23,0xF7);
SFR(USBCON ,0xF4);


SFR(PWMCFG45,0xFE);
SFR(USBADR,0xFC);
SFR(RSTCFG,0xFF);

#define EN_XSFR()        P_SW2 |=  0x80
#define DIS_XSFR()       P_SW2 &= ~0x80

// --- DMA ---------------------------------------------------------------------------------------

// - DMA: M2M
#define DMA_M2M_CR     (*(unsigned char volatile __xdata *)0xFA01)
#define DMA_M2M_STA    (*(unsigned char volatile __xdata *)0xFA02)
#define DMA_M2M_AMT    (*(unsigned char volatile __xdata *)0xFA03)
#define DMA_M2M_DONE   (*(unsigned char volatile __xdata *)0xFA04)
#define DMA_M2M_TXAH   (*(unsigned char volatile __xdata *)0xFA05)
#define DMA_M2M_TXAL   (*(unsigned char volatile __xdata *)0xFA06)
#define DMA_M2M_RXAH   (*(unsigned char volatile __xdata *)0xFA07)
#define DMA_M2M_RXAL   (*(unsigned char volatile __xdata *)0xFA08)

// - DMA: ADC
#define DMA_ADC_CFG    (*(unsigned char volatile __xdata *)0xFA10)
#define DMA_ADC_CR     (*(unsigned char volatile __xdata *)0xFA11)
#define DMA_ADC_STA    (*(unsigned char volatile __xdata *)0xFA12)
#define DMA_ADC_RXAH   (*(unsigned char volatile __xdata *)0xFA17)
#define DMA_ADC_RXAL   (*(unsigned char volatile __xdata *)0xFA18)
#define DMA_ADC_CFG2   (*(unsigned char volatile __xdata *)0xFA19)
#define DMA_ADC_CHSW0  (*(unsigned char volatile __xdata *)0xFA1A)
#define DMA_ADC_CHSW1  (*(unsigned char volatile __xdata *)0xFA1B)

// - DMA: SPI
#define DMA_SPI_CFG    (*(unsigned char volatile __xdata *)0xFA20)
#define SPIIE   0x80
#define ACT_TX  0x40
#define ACT_RX  0x20
#define SPIIP1  0x08
#define SPIIP0  0x04
#define SPIPTY1 0x02
#define SPIPTY0 0x01

#define DMA_SPI_CR     (*(unsigned char volatile __xdata *)0xFA21)
#define ENSPI   0x80
#define TRIG_M  0x40
#define TRIG_S  0x20
#define CLRFIFO 0x01

#define DMA_SPI_STA    (*(unsigned char volatile __xdata *)0xFA22)
#define TXOVW   0x04
#define RXLOSS  0x02
#define SPIIF   0x01

#define DMA_SPI_AMT    (*(unsigned char volatile __xdata *)0xFA23)
#define DMA_SPI_DONE   (*(unsigned char volatile __xdata *)0xFA24)
#define DMA_SPI_TXAH   (*(unsigned char volatile __xdata *)0xFA25)
#define DMA_SPI_TXAL   (*(unsigned char volatile __xdata *)0xFA26)
#define DMA_SPI_RXAH   (*(unsigned char volatile __xdata *)0xFA27)
#define DMA_SPI_RXAL   (*(unsigned char volatile __xdata *)0xFA28)

