JKN0/RocManV2/Software/STC8A8.h
#define DMA_SPI_CFG2   (*(unsigned char volatile __xdata *)0xFA29)
#define WRPSS   0x04
#define SSS1    0x02
#define SSS0    0x01

// - DMA: UARTs
#define DMA_UR1T_CFG   (*(unsigned char volatile __xdata *)0xFA30)
#define DMA_UR1T_CR    (*(unsigned char volatile __xdata *)0xFA31)
#define DMA_UR1T_STA   (*(unsigned char volatile __xdata *)0xFA32)
#define DMA_UR1T_AMT   (*(unsigned char volatile __xdata *)0xFA33)
#define DMA_UR1T_DONE  (*(unsigned char volatile __xdata *)0xFA34)
#define DMA_UR1T_TXAH  (*(unsigned char volatile __xdata *)0xFA35)
#define DMA_UR1T_TXAL  (*(unsigned char volatile __xdata *)0xFA36)
#define DMA_UR1R_CFG   (*(unsigned char volatile __xdata *)0xFA38)
#define DMA_UR1R_CR    (*(unsigned char volatile __xdata *)0xFA39)
#define DMA_UR1R_STA   (*(unsigned char volatile __xdata *)0xFA3A)
#define DMA_UR1R_AMT   (*(unsigned char volatile __xdata *)0xFA3B)
#define DMA_UR1R_DONE  (*(unsigned char volatile __xdata *)0xFA3C)
#define DMA_UR1R_TXAH  (*(unsigned char volatile __xdata *)0xFA3D)
#define DMA_UR1R_TXAL  (*(unsigned char volatile __xdata *)0xFA3E)
#define DMA_UR2T_CFG   (*(unsigned char volatile __xdata *)0xFA40)
#define DMA_UR2T_CR    (*(unsigned char volatile __xdata *)0xFA41)
#define DMA_UR2T_STA   (*(unsigned char volatile __xdata *)0xFA42)
#define DMA_UR2T_AMT   (*(unsigned char volatile __xdata *)0xFA43)
#define DMA_UR2T_DONE  (*(unsigned char volatile __xdata *)0xFA44)
#define DMA_UR2T_TXAH  (*(unsigned char volatile __xdata *)0xFA45)
#define DMA_UR2T_TXAL  (*(unsigned char volatile __xdata *)0xFA46)
#define DMA_UR2R_CFG   (*(unsigned char volatile __xdata *)0xFA48)
#define DMA_UR2R_CR    (*(unsigned char volatile __xdata *)0xFA49)
#define DMA_UR2R_STA   (*(unsigned char volatile __xdata *)0xFA4A)
#define DMA_UR2R_AMT   (*(unsigned char volatile __xdata *)0xFA4B)
#define DMA_UR2R_DONE  (*(unsigned char volatile __xdata *)0xFA4C)
#define DMA_UR2R_TXAH  (*(unsigned char volatile __xdata *)0xFA4D)
#define DMA_UR2R_TXAL  (*(unsigned char volatile __xdata *)0xFA4E)
#define DMA_UR3T_CFG   (*(unsigned char volatile __xdata *)0xFA50)
#define DMA_UR3T_CR    (*(unsigned char volatile __xdata *)0xFA51)
#define DMA_UR3T_STA   (*(unsigned char volatile __xdata *)0xFA52)
#define DMA_UR3T_AMT   (*(unsigned char volatile __xdata *)0xFA53)
#define DMA_UR3T_DONE  (*(unsigned char volatile __xdata *)0xFA54)
#define DMA_UR3T_TXAH  (*(unsigned char volatile __xdata *)0xFA55)
#define DMA_UR3T_TXAL  (*(unsigned char volatile __xdata *)0xFA56)
#define DMA_UR3R_CFG   (*(unsigned char volatile __xdata *)0xFA58)
#define DMA_UR3R_CR    (*(unsigned char volatile __xdata *)0xFA59)
#define DMA_UR3R_STA   (*(unsigned char volatile __xdata *)0xFA5A)
#define DMA_UR3R_AMT   (*(unsigned char volatile __xdata *)0xFA5B)
#define DMA_UR3R_DONE  (*(unsigned char volatile __xdata *)0xFA5C)
#define DMA_UR3R_TXAH  (*(unsigned char volatile __xdata *)0xFA5D)
#define DMA_UR3R_TXAL  (*(unsigned char volatile __xdata *)0xFA5E)
#define DMA_UR4T_CFG   (*(unsigned char volatile __xdata *)0xFA60)
#define DMA_UR4T_CR    (*(unsigned char volatile __xdata *)0xFA61)
#define DMA_UR4T_STA   (*(unsigned char volatile __xdata *)0xFA62)
#define DMA_UR4T_AMT   (*(unsigned char volatile __xdata *)0xFA63)
#define DMA_UR4T_DONE  (*(unsigned char volatile __xdata *)0xFA64)
#define DMA_UR4T_TXAH  (*(unsigned char volatile __xdata *)0xFA65)
#define DMA_UR4T_TXAL  (*(unsigned char volatile __xdata *)0xFA66)
#define DMA_UR4R_CFG   (*(unsigned char volatile __xdata *)0xFA68)
#define DMA_UR4R_CR    (*(unsigned char volatile __xdata *)0xFA69)
#define DMA_UR4R_STA   (*(unsigned char volatile __xdata *)0xFA6A)
#define DMA_UR4R_AMT   (*(unsigned char volatile __xdata *)0xFA6B)
#define DMA_UR4R_DONE  (*(unsigned char volatile __xdata *)0xFA6C)
#define DMA_UR4R_TXAH  (*(unsigned char volatile __xdata *)0xFA6D)
#define DMA_UR4R_TXAL  (*(unsigned char volatile __xdata *)0xFA6E)

// - DMA: LCM
#define DMA_LCM_CFG    (*(unsigned char volatile __xdata *)0xFA70)
#define DMA_LCM_CR     (*(unsigned char volatile __xdata *)0xFA71)
#define DMA_LCM_STA    (*(unsigned char volatile __xdata *)0xFA72)
#define DMA_LCM_AMT    (*(unsigned char volatile __xdata *)0xFA73)
#define DMA_LCM_DONE   (*(unsigned char volatile __xdata *)0xFA74)
#define DMA_LCM_TXAH   (*(unsigned char volatile __xdata *)0xFA75)
#define DMA_LCM_TXAL   (*(unsigned char volatile __xdata *)0xFA76)
#define DMA_LCM_RXAH   (*(unsigned char volatile __xdata *)0xFA77)
#define DMA_LCM_RXAL   (*(unsigned char volatile __xdata *)0xFA78)



#define I2C_USE_P14P15()    P_SW2 &= ~0x30                  
#define I2C_USE_P24P25()    P_SW2  = (P_SW2 & ~0x30) | 0x10 
#define I2C_USE_P76P77()    P_SW2  = (P_SW2 & ~0x30) | 0x20 
#define I2C_USE_P33P32()    P_SW2 |= 0x30                   

#define CLKSEL      (*(unsigned char volatile __xdata *)0xfe00)
#define CKSEL       (*(unsigned char volatile __xdata *)0xfe00)
#define CLKDIV      (*(unsigned char volatile __xdata *)0xfe01)
#define IRC24MCR    (*(unsigned char volatile __xdata *)0xfe02)
#define XOSCCR      (*(unsigned char volatile __xdata *)0xfe03)
#define IRC32KCR    (*(unsigned char volatile __xdata *)0xfe04)
#define MCLKOCR     (*(unsigned char volatile __xdata *)0xfe05)
#define IRCDB       (*(unsigned char volatile __xdata *)0xfe06)
#define X32KCR      (*(unsigned char volatile __xdata *)0xfe08)

                  
#define I2CCFG      (*(unsigned char volatile __xdata *)0xfe80)
#define I2CMSCR     (*(unsigned char volatile __xdata *)0xfe81)
#define I2CMSST     (*(unsigned char volatile __xdata *)0xfe82)
#define I2CSLCR     (*(unsigned char volatile __xdata *)0xfe83)
#define I2CSLST     (*(unsigned char volatile __xdata *)0xfe84)
#define I2CSLADR    (*(unsigned char volatile __xdata *)0xfe85)
#define I2CTXD      (*(unsigned char volatile __xdata *)0xfe86)
#define I2CRXD      (*(unsigned char volatile __xdata *)0xfe87)
#define I2CMSAUX    (*(unsigned char volatile __xdata *)0xfe88)


#define PWMA_ETRPS  (*(unsigned char volatile __xdata *)0xfeb0)
#define PWMA_ENO    (*(unsigned char volatile __xdata *)0xfeb1)
#define PWMA_PS     (*(unsigned char volatile __xdata *)0xfeb2)
#define PWMA_IOAUX  (*(unsigned char volatile __xdata *)0xfeb3)
#define PWMB_ETRPS  (*(unsigned char volatile __xdata *)0xfeb4)
#define PWMB_ENO    (*(unsigned char volatile __xdata *)0xfeb5)
#define PWMB_PS     (*(unsigned char volatile __xdata *)0xfeb6)
#define PWMB_IOAUX  (*(unsigned char volatile __xdata *)0xfeb7)
#define PWMA_CR1    (*(unsigned char volatile __xdata *)0xfec0)
#define PWMA_CR2    (*(unsigned char volatile __xdata *)0xfec1)
#define PWMA_SMCR   (*(unsigned char volatile __xdata *)0xfec2)
#define PWMA_ETR    (*(unsigned char volatile __xdata *)0xfec3)
#define PWMA_IER    (*(unsigned char volatile __xdata *)0xfec4)
#define PWMA_SR1    (*(unsigned char volatile __xdata *)0xfec5)
#define PWMA_SR2    (*(unsigned char volatile __xdata *)0xfec6)
#define PWMA_EGR    (*(unsigned char volatile __xdata *)0xfec7)
#define PWMA_CCMR1  (*(unsigned char volatile __xdata *)0xfec8)
#define PWMA_CCMR2  (*(unsigned char volatile __xdata *)0xfec9)
#define PWMA_CCMR3  (*(unsigned char volatile __xdata *)0xfeca)
#define PWMA_CCMR4  (*(unsigned char volatile __xdata *)0xfecb)
#define PWMA_CCER1  (*(unsigned char volatile __xdata *)0xfecc)
#define PWMA_CCER2  (*(unsigned char volatile __xdata *)0xfecd)
#define PWMA_CNTR   (*(unsigned int  volatile __xdata *)0xfece)
#define PWMA_CNTRH  (*(unsigned char volatile __xdata *)0xfece)
#define PWMA_CNTRL  (*(unsigned char volatile __xdata *)0xfecf)
#define PWMA_PSCR   (*(unsigned int  volatile __xdata *)0xfed0)
#define PWMA_PSCRH  (*(unsigned char volatile __xdata *)0xfed0)
#define PWMA_PSCRL  (*(unsigned char volatile __xdata *)0xfed1)
#define PWMA_ARR    (*(unsigned int  volatile __xdata *)0xfed2)
#define PWMA_ARRH   (*(unsigned char volatile __xdata *)0xfed2)
#define PWMA_ARRL   (*(unsigned char volatile __xdata *)0xfed3)
#define PWMA_RCR    (*(unsigned char volatile __xdata *)0xfed4)
#define PWMA_CCR1   (*(unsigned int  volatile __xdata *)0xfed5)
#define PWMA_CCR1H  (*(unsigned char volatile __xdata *)0xfed5)
#define PWMA_CCR1L  (*(unsigned char volatile __xdata *)0xfed6)
#define PWMA_CCR2   (*(unsigned int  volatile __xdata *)0xfed7)
#define PWMA_CCR2H  (*(unsigned char volatile __xdata *)0xfed7)
#define PWMA_CCR2L  (*(unsigned char volatile __xdata *)0xfed8)
#define PWMA_CCR3   (*(unsigned int  volatile __xdata *)0xfed9)
#define PWMA_CCR3H  (*(unsigned char volatile __xdata *)0xfed9)
#define PWMA_CCR3L  (*(unsigned char volatile __xdata *)0xfeda)
#define PWMA_CCR4   (*(unsigned int  volatile __xdata *)0xfedb)
#define PWMA_CCR4H  (*(unsigned char volatile __xdata *)0xfedb)
#define PWMA_CCR4L  (*(unsigned char volatile __xdata *)0xfedc)
#define PWMA_BRK    (*(unsigned char volatile __xdata *)0xfedd)
#define PWMA_DTR    (*(unsigned char volatile __xdata *)0xfede)
#define PWMA_OISR   (*(unsigned char volatile __xdata *)0xfedf)
                    
