JKN0/RocManV2/Software/STC8A8.h
#define PWMB_CR1    (*(unsigned char volatile __xdata *)0xfee0)
#define PWMB_CR2    (*(unsigned char volatile __xdata *)0xfee1)
#define PWMB_SMCR   (*(unsigned char volatile __xdata *)0xfee2)
#define PWMB_ETR    (*(unsigned char volatile __xdata *)0xfee3)
#define PWMB_IER    (*(unsigned char volatile __xdata *)0xfee4)
#define PWMB_SR1    (*(unsigned char volatile __xdata *)0xfee5)
#define PWMB_SR2    (*(unsigned char volatile __xdata *)0xfee6)
#define PWMB_EGR    (*(unsigned char volatile __xdata *)0xfee7)
#define PWMB_CCMR1  (*(unsigned char volatile __xdata *)0xfee8)
#define PWMB_CCMR2  (*(unsigned char volatile __xdata *)0xfee9)
#define PWMB_CCMR3  (*(unsigned char volatile __xdata *)0xfeea)
#define PWMB_CCMR4  (*(unsigned char volatile __xdata *)0xfeeb)
#define PWMB_CCER1  (*(unsigned char volatile __xdata *)0xfeec)
#define PWMB_CCER2  (*(unsigned char volatile __xdata *)0xfeed)
#define PWMB_CNTR   (*(unsigned int  volatile __xdata *)0xfeee)
#define PWMB_CNTRH  (*(unsigned char volatile __xdata *)0xfeee)
#define PWMB_CNTRL  (*(unsigned char volatile __xdata *)0xfeef)
#define PWMB_PSCR   (*(unsigned int  volatile __xdata *)0xfef0)
#define PWMB_PSCRH  (*(unsigned char volatile __xdata *)0xfef0)
#define PWMB_PSCRL  (*(unsigned char volatile __xdata *)0xfef1)
#define PWMB_ARR    (*(unsigned int  volatile __xdata *)0xfef2)
#define PWMB_ARRH   (*(unsigned char volatile __xdata *)0xfef2)
#define PWMB_ARRL   (*(unsigned char volatile __xdata *)0xfef3)
#define PWMB_RCR    (*(unsigned char volatile __xdata *)0xfef4)
#define PWMB_CCR5   (*(unsigned int  volatile __xdata *)0xfef5)
#define PWMB_CCR5H  (*(unsigned char volatile __xdata *)0xfef5)
#define PWMB_CCR5L  (*(unsigned char volatile __xdata *)0xfef6)
#define PWMB_CCR6   (*(unsigned int  volatile __xdata *)0xfef7)
#define PWMB_CCR6H  (*(unsigned char volatile __xdata *)0xfef7)
#define PWMB_CCR6L  (*(unsigned char volatile __xdata *)0xfef8)
#define PWMB_CCR7   (*(unsigned int  volatile __xdata *)0xfef9)
#define PWMB_CCR7H  (*(unsigned char volatile __xdata *)0xfef9)
#define PWMB_CCR7L  (*(unsigned char volatile __xdata *)0xfefa)
#define PWMB_CCR8   (*(unsigned int  volatile __xdata *)0xfefb)
#define PWMB_CCR8H  (*(unsigned char volatile __xdata *)0xfefb)
#define PWMB_CCR8L  (*(unsigned char volatile __xdata *)0xfefc)
#define PWMB_BRK    (*(unsigned char volatile __xdata *)0xfefd)
#define PWMB_DTR    (*(unsigned char volatile __xdata *)0xfefe)
#define PWMB_OISR   (*(unsigned char volatile __xdata *)0xfeff)

/////////////////////////////////////////////////
//FD00H-FDFFH
/////////////////////////////////////////////////

#define     PWM0C       (*(unsigned int volatile __xdata *)0xff00)
#define     PWM0CH      (*(unsigned char volatile __xdata *)0xff00)
#define     PWM0CL      (*(unsigned char volatile __xdata *)0xff01)
#define     PWM0CKS     (*(unsigned char volatile __xdata *)0xff02)
#define     PWM0TADC    (*(unsigned int volatile __xdata *)0xff03)
#define     PWM0TADCH   (*(unsigned char volatile __xdata *)0xff03)
#define     PWM0TADCL   (*(unsigned char volatile __xdata *)0xff04)
#define     PWM0IF      (*(unsigned char volatile __xdata *)0xff05)
#define     PWM0FDCR    (*(unsigned char volatile __xdata *)0xff06)
#define     PWM00T1     (*(unsigned int volatile __xdata *)0xff10)
#define     PWM00T1H    (*(unsigned char volatile __xdata *)0xff10)
#define     PWM00T1L    (*(unsigned char volatile __xdata *)0xff11)
#define     PWM00T2     (*(unsigned int volatile __xdata *)0xff12)
#define     PWM00T2H    (*(unsigned char volatile __xdata *)0xff12)
#define     PWM00T2L    (*(unsigned char volatile __xdata *)0xff13)
#define     PWM00CR     (*(unsigned char volatile __xdata *)0xff14)
#define     PWM00HLD    (*(unsigned char volatile __xdata *)0xff15)
#define     PWM01T1     (*(unsigned int volatile __xdata *)0xff18)
#define     PWM01T1H    (*(unsigned char volatile __xdata *)0xff18)
#define     PWM01T1L    (*(unsigned char volatile __xdata *)0xff19)
#define     PWM01T2     (*(unsigned int volatile __xdata *)0xff1a)
#define     PWM01T2H    (*(unsigned char volatile __xdata *)0xff1a)
#define     PWM01T2L    (*(unsigned char volatile __xdata *)0xff1b)
#define     PWM01CR     (*(unsigned char volatile __xdata *)0xff1c)
#define     PWM01HLD    (*(unsigned char volatile __xdata *)0xff1d)
#define     PWM02T1     (*(unsigned int volatile __xdata *)0xff20)
#define     PWM02T1H    (*(unsigned char volatile __xdata *)0xff20)
#define     PWM02T1L    (*(unsigned char volatile __xdata *)0xff21)
#define     PWM02T2     (*(unsigned int volatile __xdata *)0xff22)
#define     PWM02T2H    (*(unsigned char volatile __xdata *)0xff22)
#define     PWM02T2L    (*(unsigned char volatile __xdata *)0xff23)
#define     PWM02CR     (*(unsigned char volatile __xdata *)0xff24)
#define     PWM02HLD    (*(unsigned char volatile __xdata *)0xff25)
#define     PWM03T1     (*(unsigned int volatile __xdata *)0xff28)
#define     PWM03T1H    (*(unsigned char volatile __xdata *)0xff28)
#define     PWM03T1L    (*(unsigned char volatile __xdata *)0xff29)
#define     PWM03T2     (*(unsigned int volatile __xdata *)0xff2a)
#define     PWM03T2H    (*(unsigned char volatile __xdata *)0xff2a)
#define     PWM03T2L    (*(unsigned char volatile __xdata *)0xff2b)
#define     PWM03CR     (*(unsigned char volatile __xdata *)0xff2c)
#define     PWM03HLD    (*(unsigned char volatile __xdata *)0xff2d)
#define     PWM04T1     (*(unsigned int volatile __xdata *)0xff30)
#define     PWM04T1H    (*(unsigned char volatile __xdata *)0xff30)
#define     PWM04T1L    (*(unsigned char volatile __xdata *)0xff31)
#define     PWM04T2     (*(unsigned int volatile __xdata *)0xff32)
#define     PWM04T2H    (*(unsigned char volatile __xdata *)0xff32)
#define     PWM04T2L    (*(unsigned char volatile __xdata *)0xff33)
#define     PWM04CR     (*(unsigned char volatile __xdata *)0xff34)
#define     PWM04HLD    (*(unsigned char volatile __xdata *)0xff35)
#define     PWM05T1     (*(unsigned int volatile __xdata *)0xff38)
#define     PWM05T1H    (*(unsigned char volatile __xdata *)0xff38)
#define     PWM05T1L    (*(unsigned char volatile __xdata *)0xff39)
#define     PWM05T2     (*(unsigned int volatile __xdata *)0xff3a)
#define     PWM05T2H    (*(unsigned char volatile __xdata *)0xff3a)
#define     PWM05T2L    (*(unsigned char volatile __xdata *)0xff3b)
#define     PWM05CR     (*(unsigned char volatile __xdata *)0xff3c)
#define     PWM05HLD    (*(unsigned char volatile __xdata *)0xff3d)
#define     PWM06T1     (*(unsigned int volatile __xdata *)0xff40)
#define     PWM06T1H    (*(unsigned char volatile __xdata *)0xff40)
#define     PWM06T1L    (*(unsigned char volatile __xdata *)0xff41)
#define     PWM06T2     (*(unsigned int volatile __xdata *)0xff42)
#define     PWM06T2H    (*(unsigned char volatile __xdata *)0xff42)
#define     PWM06T2L    (*(unsigned char volatile __xdata *)0xff43)
#define     PWM06CR     (*(unsigned char volatile __xdata *)0xff44)
#define     PWM06HLD    (*(unsigned char volatile __xdata *)0xff45)
#define     PWM07T1     (*(unsigned int volatile __xdata *)0xff48)
#define     PWM07T1H    (*(unsigned char volatile __xdata *)0xff48)
#define     PWM07T1L    (*(unsigned char volatile __xdata *)0xff49)
#define     PWM07T2     (*(unsigned int volatile __xdata *)0xff4a)
#define     PWM07T2H    (*(unsigned char volatile __xdata *)0xff4a)
#define     PWM07T2L    (*(unsigned char volatile __xdata *)0xff4b)
#define     PWM07CR     (*(unsigned char volatile __xdata *)0xff4c)
#define     PWM07HLD    (*(unsigned char volatile __xdata *)0xff4d)
#define     PWM1C       (*(unsigned int volatile __xdata *)0xff50)
#define     PWM1CH      (*(unsigned char volatile __xdata *)0xff50)
#define     PWM1CL      (*(unsigned char volatile __xdata *)0xff51)
#define     PWM1CKS     (*(unsigned char volatile __xdata *)0xff52)
#define     PWM1IF      (*(unsigned char volatile __xdata *)0xff55)
#define     PWM1FDCR    (*(unsigned char volatile __xdata *)0xff56)
#define     PWM10T1     (*(unsigned int volatile __xdata *)0xff60)
#define     PWM10T1H    (*(unsigned char volatile __xdata *)0xff60)
#define     PWM10T1L    (*(unsigned char volatile __xdata *)0xff61)
#define     PWM10T2     (*(unsigned int volatile __xdata *)0xff62)
#define     PWM10T2H    (*(unsigned char volatile __xdata *)0xff62)
#define     PWM10T2L    (*(unsigned char volatile __xdata *)0xff63)
#define     PWM10CR     (*(unsigned char volatile __xdata *)0xff64)
#define     PWM10HLD    (*(unsigned char volatile __xdata *)0xff65)
#define     PWM11T1     (*(unsigned int volatile __xdata *)0xff68)
#define     PWM11T1H    (*(unsigned char volatile __xdata *)0xff68)
#define     PWM11T1L    (*(unsigned char volatile __xdata *)0xff69)
#define     PWM11T2     (*(unsigned int volatile __xdata *)0xff6a)
#define     PWM11T2H    (*(unsigned char volatile __xdata *)0xff6a)
#define     PWM11T2L    (*(unsigned char volatile __xdata *)0xff6b)
#define     PWM11CR     (*(unsigned char volatile __xdata *)0xff6c)
#define     PWM11HLD    (*(unsigned char volatile __xdata *)0xff6d)
#define     PWM12T1     (*(unsigned int volatile __xdata *)0xff70)
#define     PWM12T1H    (*(unsigned char volatile __xdata *)0xff70)
#define     PWM12T1L    (*(unsigned char volatile __xdata *)0xff71)
#define     PWM12T2     (*(unsigned int volatile __xdata *)0xff72)
#define     PWM12T2H    (*(unsigned char volatile __xdata *)0xff72)
#define     PWM12T2L    (*(unsigned char volatile __xdata *)0xff73)
#define     PWM12CR     (*(unsigned char volatile __xdata *)0xff74)
#define     PWM12HLD    (*(unsigned char volatile __xdata *)0xff75)
#define     PWM13T1     (*(unsigned int volatile __xdata *)0xff78)
#define     PWM13T1H    (*(unsigned char volatile __xdata *)0xff78)
#define     PWM13T1L    (*(unsigned char volatile __xdata *)0xff79)
#define     PWM13T2     (*(unsigned int volatile __xdata *)0xff7a)
#define     PWM13T2H    (*(unsigned char volatile __xdata *)0xff7a)
#define     PWM13T2L    (*(unsigned char volatile __xdata *)0xff7b)
#define     PWM13CR     (*(unsigned char volatile __xdata *)0xff7c)
#define     PWM13HLD    (*(unsigned char volatile __xdata *)0xff7d)
#define     PWM14T1     (*(unsigned int volatile __xdata *)0xff80)
#define     PWM14T1H    (*(unsigned char volatile __xdata *)0xff80)
#define     PWM14T1L    (*(unsigned char volatile __xdata *)0xff81)
#define     PWM14T2     (*(unsigned int volatile __xdata *)0xff82)
#define     PWM14T2H    (*(unsigned char volatile __xdata *)0xff82)
#define     PWM14T2L    (*(unsigned char volatile __xdata *)0xff83)
#define     PWM14CR     (*(unsigned char volatile __xdata *)0xff84)
#define     PWM14HLD    (*(unsigned char volatile __xdata *)0xff85)
#define     PWM15T1     (*(unsigned int volatile __xdata *)0xff88)
#define     PWM15T1H    (*(unsigned char volatile __xdata *)0xff88)
#define     PWM15T1L    (*(unsigned char volatile __xdata *)0xff89)
#define     PWM15T2     (*(unsigned int volatile __xdata *)0xff8a)
#define     PWM15T2H    (*(unsigned char volatile __xdata *)0xff8a)
#define     PWM15T2L    (*(unsigned char volatile __xdata *)0xff8b)
#define     PWM15CR     (*(unsigned char volatile __xdata *)0xff8c)
#define     PWM15HLD    (*(unsigned char volatile __xdata *)0xff8d)
#define     PWM16T1     (*(unsigned int volatile __xdata *)0xff90)
#define     PWM16T1H    (*(unsigned char volatile __xdata *)0xff90)
#define     PWM16T1L    (*(unsigned char volatile __xdata *)0xff91)
#define     PWM16T2     (*(unsigned int volatile __xdata *)0xff92)
#define     PWM16T2H    (*(unsigned char volatile __xdata *)0xff92)
#define     PWM16T2L    (*(unsigned char volatile __xdata *)0xff93)
#define     PWM16CR     (*(unsigned char volatile __xdata *)0xff94)
#define     PWM16HLD    (*(unsigned char volatile __xdata *)0xff95)
#define     PWM17T1     (*(unsigned int volatile __xdata *)0xff98)
#define     PWM17T1H    (*(unsigned char volatile __xdata *)0xff98)
#define     PWM17T1L    (*(unsigned char volatile __xdata *)0xff99)
#define     PWM17T2     (*(unsigned int volatile __xdata *)0xff9a)
#define     PWM17T2H    (*(unsigned char volatile __xdata *)0xff9a)
#define     PWM17T2L    (*(unsigned char volatile __xdata *)0xff9b)
#define     PWM17CR     (*(unsigned char volatile __xdata *)0xff9c)
#define     PWM17HLD    (*(unsigned char volatile __xdata *)0xff9d)
#define     PWM2C       (*(unsigned int volatile __xdata *)0xffa0)
#define     PWM2CH      (*(unsigned char volatile __xdata *)0xffa0)
#define     PWM2CL      (*(unsigned char volatile __xdata *)0xffa1)
#define     PWM2CKS     (*(unsigned char volatile __xdata *)0xffa2)
#define     PWM2TADC    (*(unsigned int volatile __xdata *)0xffa3)
#define     PWM2TADCH   (*(unsigned char volatile __xdata *)0xffa3)
#define     PWM2TADCL   (*(unsigned char volatile __xdata *)0xffa4)
#define     PWM2IF      (*(unsigned char volatile __xdata *)0xffa5)
#define     PWM2FDCR    (*(unsigned char volatile __xdata *)0xffa6)
#define     PWM20T1     (*(unsigned int volatile __xdata *)0xffb0)
#define     PWM20T1H    (*(unsigned char volatile __xdata *)0xffb0)
#define     PWM20T1L    (*(unsigned char volatile __xdata *)0xffb1)
#define     PWM20T2     (*(unsigned int volatile __xdata *)0xffb2)
#define     PWM20T2H    (*(unsigned char volatile __xdata *)0xffb2)
#define     PWM20T2L    (*(unsigned char volatile __xdata *)0xffb3)
#define     PWM20CR     (*(unsigned char volatile __xdata *)0xffb4)
#define     PWM20HLD    (*(unsigned char volatile __xdata *)0xffb5)
#define     PWM21T1     (*(unsigned int volatile __xdata *)0xffb8)
#define     PWM21T1H    (*(unsigned char volatile __xdata *)0xffb8)
#define     PWM21T1L    (*(unsigned char volatile __xdata *)0xffb9)
#define     PWM21T2     (*(unsigned int volatile __xdata *)0xffba)
#define     PWM21T2H    (*(unsigned char volatile __xdata *)0xffba)
#define     PWM21T2L    (*(unsigned char volatile __xdata *)0xffbb)
#define     PWM21CR     (*(unsigned char volatile __xdata *)0xffbc)
#define     PWM21HLD    (*(unsigned char volatile __xdata *)0xffbd)
#define     PWM22T1     (*(unsigned int volatile __xdata *)0xffc0)
#define     PWM22T1H    (*(unsigned char volatile __xdata *)0xffc0)
#define     PWM22T1L    (*(unsigned char volatile __xdata *)0xffc1)
#define     PWM22T2     (*(unsigned int volatile __xdata *)0xffc2)
#define     PWM22T2H    (*(unsigned char volatile __xdata *)0xffc2)
#define     PWM22T2L    (*(unsigned char volatile __xdata *)0xffc3)
#define     PWM22CR     (*(unsigned char volatile __xdata *)0xffc4)
#define     PWM22HLD    (*(unsigned char volatile __xdata *)0xffc5)
#define     PWM23T1     (*(unsigned int volatile __xdata *)0xffc8)
#define     PWM23T1H    (*(unsigned char volatile __xdata *)0xffc8)
#define     PWM23T1L    (*(unsigned char volatile __xdata *)0xffc9)
#define     PWM23T2     (*(unsigned int volatile __xdata *)0xffca)
#define     PWM23T2H    (*(unsigned char volatile __xdata *)0xffca)
#define     PWM23T2L    (*(unsigned char volatile __xdata *)0xffcb)
#define     PWM23CR     (*(unsigned char volatile __xdata *)0xffcc)
#define     PWM23HLD    (*(unsigned char volatile __xdata *)0xffcd)
#define     PWM24T1     (*(unsigned int volatile __xdata *)0xffd0)
#define     PWM24T1H    (*(unsigned char volatile __xdata *)0xffd0)
#define     PWM24T1L    (*(unsigned char volatile __xdata *)0xffd1)
#define     PWM24T2     (*(unsigned int volatile __xdata *)0xffd2)
#define     PWM24T2H    (*(unsigned char volatile __xdata *)0xffd2)
#define     PWM24T2L    (*(unsigned char volatile __xdata *)0xffd3)
#define     PWM24CR     (*(unsigned char volatile __xdata *)0xffd4)
#define     PWM24HLD    (*(unsigned char volatile __xdata *)0xffd5)
#define     PWM25T1     (*(unsigned int volatile __xdata *)0xffd8)
#define     PWM25T1H    (*(unsigned char volatile __xdata *)0xffd8)
#define     PWM25T1L    (*(unsigned char volatile __xdata *)0xffd9)
#define     PWM25T2     (*(unsigned int volatile __xdata *)0xffda)
#define     PWM25T2H    (*(unsigned char volatile __xdata *)0xffda)
#define     PWM25T2L    (*(unsigned char volatile __xdata *)0xffdb)
#define     PWM25CR     (*(unsigned char volatile __xdata *)0xffdc)
#define     PWM25HLD    (*(unsigned char volatile __xdata *)0xffdd)
#define     PWM26T1     (*(unsigned int volatile __xdata *)0xffe0)
#define     PWM26T1H    (*(unsigned char volatile __xdata *)0xffe0)
#define     PWM26T1L    (*(unsigned char volatile __xdata *)0xffe1)
#define     PWM26T2     (*(unsigned int volatile __xdata *)0xffe2)
#define     PWM26T2H    (*(unsigned char volatile __xdata *)0xffe2)
#define     PWM26T2L    (*(unsigned char volatile __xdata *)0xffe3)
#define     PWM26CR     (*(unsigned char volatile __xdata *)0xffe4)
#define     PWM26HLD    (*(unsigned char volatile __xdata *)0xffe5)
#define     PWM27T1     (*(unsigned int volatile __xdata *)0xffe8)
#define     PWM27T1H    (*(unsigned char volatile __xdata *)0xffe8)
#define     PWM27T1L    (*(unsigned char volatile __xdata *)0xffe9)
#define     PWM27T2     (*(unsigned int volatile __xdata *)0xffea)
#define     PWM27T2H    (*(unsigned char volatile __xdata *)0xffea)
#define     PWM27T2L    (*(unsigned char volatile __xdata *)0xffeb)
#define     PWM27CR     (*(unsigned char volatile __xdata *)0xffec)
#define     PWM27HLD    (*(unsigned char volatile __xdata *)0xffed)

/////////////////////////////////////////////////
//FC00H-FCFFH
/////////////////////////////////////////////////

